# ExecuteAllRules Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PerformanceAdviser..::..ExecuteAllRules Method
PerformanceAdviser Class See Also
---
Executes all rules in the list on a given document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<FailureMessage> ExecuteAllRules(
	Document document
)
```

Visual Basic
---
```text
Public Function ExecuteAllRules ( _
	document As Document _
) As IList(Of FailureMessage)
```

Visual C++
---
```text
public:
IList<FailureMessage^>^ ExecuteAllRules(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Document on which the rules will be executed.
# ### Return Value
Failure messages explaining performance problems detected in the document.
# Remarks
Disabled rules are not executed.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PerformanceAdviser Class
Autodesk.Revit.DB Namespace